a =(input('星座分析请输入您的名字'))
print('编号    星座    日期')
print('%s\t%s\t%s'%(1,'水瓶座','1月20-2月18'))
print('%s\t%s\t%s'%(2,'双鱼座','2月19-3月20'))
print('%s\t%s\t%s'%(3,'白羊座','3月21-4月19'))
print('%s\t%s\t%s'%(4,'金牛座','4月20-5月20'))
print('%s\t%s\t%s'%(5,'双子座','5月21-6月21'))
print('%s\t%s\t%s'%(6,'巨蟹座','6月21-7月22'))
print('%s\t%s\t%s'%(7,'狮子座','7月23-8月22'))
print('%s\t%s\t%s'%(8,'处女座','8月23-9月22'))
b =int(input('请输入编号'))
if b ==1:
    print('您好,水瓶座您的分析结果:日期是1月20-2月20,性格是xxx')
if b ==2:
    print('您好,双鱼座您的分析结果:日期是2月20-3月20,性格是xxx')
if b ==3:
    print('您好,白羊座您的分析结果:日期是3月21-4月19,性格是xxx')
if b ==4:
    print('您好,金牛座您的分析结果:日期是4月20-5月20,性格是xxx')
if b ==5:
    print('您好,双子座您的分析结果:日期是5月21-6月21,性格是xxx')
if b ==6:
    print('您好,巨蟹座您的分析结果:日期是6月22-7月22,性格是xxx')
if b ==7:
    print('您好,狮子座您的分析结果:日期是7月23-8月22,性格是xxx')
if b ==8:
    print('您好,处女座您的分析结果:日期是8月23-9月22,性格是xxx')
 
